{
    "Toggle menu": "Alternar menu",
    "Home": "Início",
    "Tools": "Ferramentas",
    "Blog": "Blog",
    "Contact": "Contato",
    "Toggle dark mode": "Alternar modo escuro",
    "toolz": "toolz",
    "Free online tools for everyone.": "Ferramentas online gratuitas para todos.",
    "Pages": "Páginas",
    "Legal": "Legal",
    "Terms of Use": "Termos de Uso",
    "All rights reserved.": "Todos os direitos reservados.",
    "Free Online Tools For Everyone": "Ferramentas online gratuitas para todos",
    "A collection of helpful web tools designed to make your digital life easier.": "Uma coleção de ferramentas úteis desenvolvidas para facilitar sua vida digital.",
    "Our Popular Tools": "Nossas ferramentas populares",
    "Consent Mode Banner": "Banner de Consentimento",
    "Generate cookie consent banners for your website": "Gere banners de consentimento de cookies para seu site",
    "Simula Fácil": "Simula Fácil",
    "Various financial calculators": "Diversas calculadoras financeiras",
    "Clik Now": "Clik Now",
    "URL shortener to create shorter links": "Encurtador de URL para criar links menores",
    "Timer": "Timer",
    "Simple countdown timer": "Cronômetro regressivo simples",
    "View All Tools": "Ver todas as ferramentas",
    "Latest from our Blog": "Últimas do nosso blog",
    "JavaScript Best Practices in 2025": "Melhores práticas de JavaScript em 2025",
    "May 15, 2025": "15 de maio de 2025",
    "Explore the modern JavaScript practices that will help you write cleaner, more efficient code.": "Explore as práticas modernas de JavaScript que vão te ajudar a escrever códigos mais limpos e eficientes.",
    "Web Accessibility: A Comprehensive Guide": "Acessibilidade na Web: Um guia completo",
    "May 10, 2025": "10 de maio de 2025",
    "Learn how to make your websites accessible to everyone, including people with disabilities.": "Aprenda a tornar seus sites acessíveis para todos, incluindo pessoas com deficiência.",
    "Advanced CSS Layout Techniques": "Técnicas avançadas de layout em CSS",
    "May 5, 2025": "5 de maio de 2025",
    "Master CSS Grid and Flexbox to create complex layouts with ease.": "Domine CSS Grid e Flexbox para criar layouts complexos com facilidade.",
    "Read More Articles": "Ler mais artigos",
    "JavaScript": "JavaScript",
    "Written by": "Escrito por",
    "Web Development": "Desenvolvimento Web",
    "Others": "Outros",
    "AI": "IA",
    "Coding": "Programação",
    "Best Practices": "Melhores práticas",
    "Next Article": "Próximo artigo",
    "Related Articles": "Artigos relacionados",
    "Migrating from JavaScript to TypeScript": "Migrando de JavaScript para TypeScript",
    "April 15, 2025": "15 de abril de 2025",
    "A step-by-step guide to migrating your JavaScript projects to TypeScript.": "Um guia passo a passo para migrar seus projetos JavaScript para TypeScript.",
    "Designing RESTful APIs: Best Practices": "Projetando APIs RESTful: Melhores práticas",
    "April 20, 2025": "20 de abril de 2025",
    "Learn the principles of designing clean, efficient, and user-friendly RESTful APIs.": "Aprenda os princípios de como projetar APIs RESTful limpas, eficientes e fáceis de usar.",
    "Our Tech Blog": "Nosso Blog de Tecnologia",
    "Insights, tutorials and tips on web development, tools, and technology.": "Insights, tutoriais e dicas sobre desenvolvimento web, ferramentas e tecnologia.",
    "Search articles...": "Pesquisar artigos...",
    "Search articles": "Pesquisar artigos",
    "Search": "Pesquisar",
    "All": "Todos",
    "CSS": "CSS",
    "Read more": "Leia mais",
    "Previous page": "Página anterior",
    "Next page": "Próxima página",
    "Stay Updated": "Fique atualizado",
    "Subscribe to our newsletter to receive new blog posts directly in your inbox.": "Inscreva-se na nossa newsletter para receber novos posts diretamente na sua caixa de entrada.",
    "Your email address": "Seu endereço de e-mail",
    "Subscribe": "Inscrever-se",
    "We'll never share your email with anyone else.": "Nunca compartilharemos seu e-mail com mais ninguém.",
    "Contact Us": "Fale Conosco",
    "Have questions, suggestions, or feedback? Get in touch with us!": "Tem dúvidas, sugestões ou comentários? Entre em contato conosco!",
    "We're Here to Help": "Estamos aqui para ajudar",
    "We value your feedback and are always looking for ways to improve our tools and services. Whether you have a question, suggestion, or just want to say hello, we'd love to hear from you!": "Valorizamos seu feedback e estamos sempre buscando formas de melhorar nossas ferramentas e serviços. Se você tiver uma dúvida, sugestão ou apenas quiser dizer oi, adoraríamos ouvir você!",
    "Email Us": "Envie-nos um e-mail",
    "For general inquiries:": "Para dúvidas gerais:",
    "For technical support:": "Para suporte técnico:",
    "Response Time": "Tempo de Resposta",
    "We typically respond to all inquiries within 24-48 hours during regular business days.": "Normalmente respondemos a todas as solicitações dentro de 24 a 48 horas durante os dias úteis.",
    "Connect with Us": "Conecte-se conosco",
    "Send Us a Message": "Envie-nos uma mensagem",
    "Name": "Nome",
    "Email": "E-mail",
    "Subject": "Assunto",
    "Select a subject": "Selecione um assunto",
    "General Inquiry": "Consulta Geral",
    "Technical Support": "Suporte Técnico",
    "Feedback": "Comentário",
    "Tool Suggestion": "Sugestão de Ferramenta",
    "Other": "Outro",
    "Message": "Mensagem",
    "I agree to the": "Eu concordo com a",
    "Privacy Policy": "Política de Privacidade",
    "Send Message": "Enviar Mensagem",
    "Frequently Asked Questions": "Perguntas Frequentes",
    "Are all tools completely free to use?": "Todas as ferramentas são totalmente gratuitas?",
    "Yes, all tools on Toolz.at are completely free to use without any hidden charges or subscription fees.": "Sim, todas as ferramentas no Toolz.at são totalmente gratuitas, sem cobranças ocultas ou taxas de assinatura.",
    "Do I need to create an account?": "Preciso criar uma conta?",
    "Most tools can be used without creating an account. Some tools may offer optional accounts for saving preferences or history.": "A maioria das ferramentas pode ser usada sem a criação de uma conta. Algumas ferramentas podem oferecer contas opcionais para salvar preferências ou histórico.",
    "All Tools": "Todas as Ferramentas",
    "A comprehensive collection of free web-based tools designed to simplify your online tasks.": "Uma coleção abrangente de ferramentas online gratuitas para simplificar suas tarefas.",
    "Productivity": "Produtividade",
    "Finance": "Finanças",
    "Miscellaneous": "Diversos",
    "Generate cookie consent banners for your website that comply with privacy regulations like GDPR and CCPA.": "Gere banners de consentimento para cookies que estejam em conformidade com leis como GDPR e CCPA.",
    "Collection of financial calculators for loan payments, investments, and savings plans with detailed amortization schedules.": "Coleção de calculadoras financeiras para empréstimos, investimentos e poupança com cronogramas detalhados.",
    "URL shortener service to create compact, shareable links with click tracking and analytics.": "Serviço de encurtador de URLs com rastreamento de cliques e análises.",
    "Simple countdown timer for managing your time effectively with sound alerts and customizable presets.": "Temporizador regressivo simples com alertas sonoros e predefinições personalizáveis.",
    "Chronometer": "Cronômetro",
    "Precise stopwatch with lap timing functionality for tracking elapsed time during activities or workouts.": "Cronômetro preciso com marcação de voltas para medir o tempo em atividades ou exercícios.",
    "Keyboard Test": "Teste de Teclado",
    "Tool to test your keyboard functionality, with real-time key detection and typing speed measurement.": "Ferramenta para testar seu teclado com detecção de teclas em tempo real e medição de velocidade de digitação.",
    "Can't find what you need?": "Não encontrou o que precisa?",
    "Have an idea for a useful tool? Let us know and we might build it!": "Tem uma ideia de ferramenta útil? Conte pra gente!",
    "Suggest a Tool": "Sugerir uma Ferramenta",
    "Last updated: May 1, 2025": "Última atualização: 1º de maio de 2025",
    "Contents": "Conteúdo",
    "Introduction": "Introdução",
    "Information We Collect": "Informações Que Coletamos",
    "How We Use Your Information": "Como Usamos Suas Informações",
    "Cookies and Similar Technologies": "Cookies e Tecnologias Similares",
    "Data Security": "Segurança de Dados",
    "Third-Party Services": "Serviços de Terceiros",
    "Your Rights and Choices": "Seus Direitos e Opções",
    "Children's Privacy": "Privacidade das Crianças",
    "Changes to This Privacy Policy": "Alterações Nesta Política de Privacidade",
    "Welcome to Toolz.at (\"we,\" \"our,\" or \"us\"). We respect your privacy and are committed to protecting your personal information. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you visit our website toolz.at and use any of our online tools and services.": "Bem-vindo ao Toolz.at (\"nós\", \"nosso\" ou \"nos\"). Respeitamos sua privacidade e estamos comprometidos em proteger suas informações pessoais. Esta Política de Privacidade explica como coletamos, usamos, divulgamos e protegemos suas informações quando você visita nosso site toolz.at e usa qualquer uma de nossas ferramentas e serviços online.",
    "Please read this Privacy Policy carefully. If you do not agree with the terms of this Privacy Policy, please do not access our website or use our tools.": "Por favor, leia esta Política de Privacidade cuidadosamente. Se você não concorda com os termos desta Política de Privacidade, não acesse nosso site nem use nossas ferramentas.",
    "We may collect information that you voluntarily provide when you:": "Podemos coletar informações que você nos fornece voluntariamente quando você:",
    "Contact us through our website": "Entre em contato conosco através de nosso site",
    "Subscribe to our newsletter": "Inscreva-se em nossa newsletter",
    "Use certain features of our tools that require data input": "Use certas funcionalidades de nossas ferramentas que exigem entrada de dados",
    "Participate in surveys or feedback forms": "Participe de pesquisas ou formulários de feedback",
    "This information may include:": "Essas informações podem incluir:",
    "Your name and email address": "Seu nome e endereço de e-mail",
    "Any messages or feedback you send us": "Quaisquer mensagens ou feedback que você nos enviar",
    "Data you input into our tools": "Dados que você insere em nossas ferramentas",
    "When you visit our website, we may automatically collect certain information about your device and usage patterns. This information may include:": "Quando você visita nosso site, podemos coletar automaticamente certas informações sobre seu dispositivo e padrões de uso. Essas informações podem incluir:",
    "IP address": "Endereço IP",
    "Browser type and version": "Tipo e versão do navegador",
    "Operating system": "Sistema operacional",
    "Referring website": "Website de referência",
    "Pages you view on our site": "Páginas que você visualiza em nosso site",
    "Time and date of your visit": "Hora e data da sua visita",
    "Time spent on pages": "Tempo gasto nas páginas",
    "Other statistics related to your interaction with our website": "Outras estatísticas relacionadas à sua interação com nosso site",
    "We may use the information we collect for various purposes, including:": "Podemos usar as informações que coletamos para vários fins, incluindo:",
    "Providing, maintaining, and improving our website and tools": "Fornecer, manter e melhorar nosso site e ferramentas",
    "Responding to your comments, questions, and requests": "Responder aos seus comentários, perguntas e solicitações",
    "Sending you technical notices, updates, security alerts, and administrative messages": "Enviar notificações técnicas, atualizações, alertas de segurança e mensagens administrativas",
    "Monitoring and analyzing trends, usage, and activities in connection with our website": "Monitorar e analisar tendências, uso e atividades em conexão com nosso site",
    "Detecting, preventing, and addressing technical issues": "Detectar, prevenir e resolver problemas técnicos",
    "Complying with legal obligations": "Cumprir com obrigações legais",
    "Many of our tools process data entirely within your browser. This means that the data you input into these tools is not transmitted to our servers and remains on your device. Examples include:": "Muitas de nossas ferramentas processam dados totalmente dentro do seu navegador. Isso significa que os dados que você insere nessas ferramentas não são transmitidos para nossos servidores e permanecem em seu dispositivo. Exemplos incluem:",
    "Timer and chronometer tools": "Ferramentas de cronômetro e temporizador",
    "Keyboard test": "Teste de teclado",
    "Financial calculators": "Calculadoras financeiras",
    "For tools that require server-side processing, we only retain the data necessary for the tool to function and only for as long as required.": "Para ferramentas que requerem processamento no servidor, retemos apenas os dados necessários para o funcionamento da ferramenta e apenas pelo tempo necessário.",
    "4. Cookies and Similar Technologies": "4. Cookies e Tecnologias Similares",
    "We use cookies and similar tracking technologies to track activity on our website and hold certain information.": "Usamos cookies e tecnologias de rastreamento semelhantes para acompanhar a atividade em nosso site e reter certas informações.",
    "4.1 Types of Cookies We Use": "4.1 Tipos de Cookies que Usamos",
    "Essential Cookies:": "Cookies Essenciais:",
    "These cookies are necessary for the website to function properly.": "Esses cookies são necessários para o site funcionar corretamente.",
    "Preference Cookies:": "Cookies de Preferência:",
    "These cookies remember your preferences, such as language preferences or dark mode settings.": "Esses cookies lembram suas preferências, como preferências de idioma ou configurações de modo escuro.",
    "Analytics Cookies:": "Cookies de Análise:",
    "We use analytics cookies to track visit patterns and understand how users interact with our website.": "Usamos cookies de análise para rastrear padrões de visita e entender como os usuários interagem com nosso site.",
    "4.2 Your Cookie Choices": "4.2 Suas Escolhas de Cookies",
    "Most web browsers allow you to control cookies through their settings preferences. However, if you limit the ability of websites to set cookies, you may worsen your overall user experience.": "A maioria dos navegadores permite controlar os cookies por meio das preferências de configuração. No entanto, se você limitar a capacidade dos sites de definir cookies, pode prejudicar sua experiência geral de navegação.",
    "5. Data Security": "5. Segurança dos Dados",
    "We have implemented measures designed to secure your personal information from accidental loss and from unauthorized access, use, alteration, and disclosure. All information you provide to us is stored on secure servers.": "Implementamos medidas projetadas para proteger suas informações pessoais contra perda acidental e acesso, uso, alteração e divulgação não autorizados. Todas as informações fornecidas são armazenadas em servidores seguros.",
    "Unfortunately, the transmission of information via the internet is not completely secure. Although we do our best to protect your personal information, we cannot guarantee the security of your personal information transmitted to our website. Any transmission of personal information is at your own risk.": "Infelizmente, a transmissão de informações pela internet não é completamente segura. Embora façamos o nosso melhor para proteger suas informações pessoais, não podemos garantir a segurança das informações transmitidas para o nosso site. Toda transmissão de dados pessoais é por sua conta e risco.",
    "6. Third-Party Services": "6. Serviços de Terceiros",
    "Our website may contain links to third-party websites or services that are not owned or controlled by Toolz.at. We have no control over, and assume no responsibility for, the content, privacy policies, or practices of any third-party websites or services.": "Nosso site pode conter links para sites ou serviços de terceiros que não são de propriedade ou controlados pelo Toolz.at. Não temos controle sobre, nem assumimos responsabilidade pelo conteúdo, políticas de privacidade ou práticas de sites ou serviços de terceiros.",
    "We may use third-party service providers to help us operate our website or administer activities on our behalf, such as sending newsletters or analytics. We may share your information with these third parties only to the extent necessary for them to provide these services to us.": "Podemos usar prestadores de serviços de terceiros para nos ajudar a operar nosso site ou administrar atividades em nosso nome, como o envio de boletins informativos ou análises. Podemos compartilhar suas informações com esses terceiros apenas na medida do necessário para que forneçam esses serviços para nós.",
    "7. Your Rights and Choices": "7. Seus Direitos e Escolhas",
    "Depending on your location, you may have certain rights regarding your personal information, including:": "Dependendo da sua localização, você pode ter certos direitos sobre suas informações pessoais, incluindo:",
    "The right to access the personal information we have about you": "O direito de acessar as informações pessoais que temos sobre você",
    "The right to request that we correct incomplete or inaccurate information": "O direito de solicitar que corrigimos informações incompletas ou imprecisas",
    "The right to request that we delete your personal information": "O direito de solicitar que deletamos suas informações pessoais",
    "The right to withdraw consent where we rely on consent to process your information": "O direito de retirar o consentimento quando dependemos do consentimento para processar suas informações",
    "The right to object to our processing of your personal information": "O direito de se opor ao processamento das suas informações pessoais",
    "The right to request restrictions on the processing of your data": "O direito de solicitar restrições ao processamento de seus dados",
    "The right to data portability": "O direito à portabilidade dos dados",
    "To exercise these rights, please contact us using the information in the 'Contact Us' section.": "Para exercer esses direitos, entre em contato conosco usando as informações na seção 'Contato'.",
    "8. Children's Privacy": "8. Privacidade das Crianças",
    "Our website and tools are not intended for children under 13 years of age. We do not knowingly collect personal information from children under 13. If you are a parent or guardian and you believe your child has provided us with personal information, please contact us, and we will take steps to delete such information.": "Nosso site e ferramentas não são destinados a crianças menores de 13 anos. Não coletamos conscientemente informações pessoais de crianças menores de 13 anos. Se você é pai ou responsável e acredita que seu filho nos forneceu informações pessoais, entre em contato conosco e tomaremos medidas para excluir essas informações.",
    "9. Changes to This Privacy Policy": "9. Alterações nesta Política de Privacidade",
    "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the 'Last updated' date at the top of this document.": "Podemos atualizar nossa Política de Privacidade de tempos em tempos. Notificaremos você sobre quaisquer alterações publicando a nova Política de Privacidade nesta página e atualizando a data de 'Última atualização' no topo deste documento.",
    "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "Recomendamos que você revise periodicamente esta Política de Privacidade para verificar quaisquer alterações. As alterações nesta Política de Privacidade entram em vigor quando são publicadas nesta página.",
    "10. Contact Us": "10. Contate-nos",
    "If you have any questions or concerns about this Privacy Policy or our data practices, please contact us at:": "Se você tiver alguma dúvida ou preocupação sobre esta Política de Privacidade ou nossas práticas de dados, entre em contato conosco através de:",
    "Email:": "E-mail:",
    "Or via our": "Ou através do nosso",
    "contact form": "formulário de contato",
    "1. Agreement to Terms": "1. Acordo com os Termos",
    "2. Intellectual Property Rights": "2. Direitos de Propriedade Intelectual",
    "3. User Accounts": "3. Contas de Usuário",
    "4. Prohibited Activities": "4. Atividades Proibidas",
    "5. Use of Tools": "5. Uso das Ferramentas",
    "6. Third-Party Links": "6. Links de Terceiros",
    "7. Disclaimer of Warranties": "7. Isenção de Garantias",
    "8. Limitation of Liability": "8. Limitação de Responsabilidade",
    "9. Indemnification": "9. Indenização",
    "10. Termination": "10. Rescisão",
    "11. Changes to Terms": "11. Alterações nos Termos",
    "12. Governing Law": "12. Lei Aplicável",
    "13. Contact Us": "13. Contate-Nos",
    "By accessing or using the Toolz.at website, including any tools or services offered through the website (collectively, the \"Services\"), you agree to be bound by these Terms of Use (\"Terms\"). If you disagree with any part of the Terms, you may not access the Services.": "Ao acessar ou usar o site Toolz.at, incluindo quaisquer ferramentas ou serviços oferecidos por meio do site (coletivamente, os \"Serviços\"), você concorda em cumprir estes Termos de Uso (\"Termos\"). Se você discordar de qualquer parte dos Termos, não poderá acessar os Serviços.",
    "The Services and its original content, features, and functionality are and will remain the exclusive property of Toolz.at and its licensors. The Services are protected by copyright, trademark, and other laws of both the country where Toolz.at operates and foreign countries. Our trademarks and trade dress may not be used in connection with any product or service without the prior written consent of Toolz.at.": "Os Serviços e seu conteúdo original, características e funcionalidades são e permanecerão propriedade exclusiva da Toolz.at e seus licenciadores. Os Serviços são protegidos por direitos autorais, marcas registradas e outras leis tanto do país onde a Toolz.at opera quanto de outros países. Nossas marcas registradas e identidade comercial não podem ser usadas em conexão com qualquer produto ou serviço sem o consentimento prévio por escrito da Toolz.at.",
    "2.1 Content You Submit": "2.1 Conteúdo que Você Envia",
    "Any content you submit to our Services (such as feedback, suggestions, or ideas) may be used by us without restriction, including but not limited to reproducing, modifying, adapting, publishing, translating, creating derivative works from, distributing, and displaying such content in any form, media, or technology.": "Qualquer conteúdo que você enviar aos nossos Serviços (como feedback, sugestões ou ideias) poderá ser usado por nós sem restrições, incluindo, mas não se limitando a, reproduzir, modificar, adaptar, publicar, traduzir, criar obras derivadas, distribuir e exibir esse conteúdo em qualquer forma, mídia ou tecnologia.",
    "Some of our Services may require you to create an account. You are responsible for safeguarding the password that you use to access the Services and for any activities or actions under your password. We encourage you to use \"strong\" passwords (passwords that use a combination of upper and lower case letters, numbers, and symbols) with your account.": "Alguns de nossos Serviços podem exigir que você crie uma conta. Você é responsável por proteger a senha que usa para acessar os Serviços e por quaisquer atividades ou ações realizadas sob sua senha. Incentivamos você a usar senhas \"fortes\" (senhas que utilizam uma combinação de letras maiúsculas e minúsculas, números e símbolos) em sua conta.",
    "You agree not to disclose your password to any third party. You must notify us immediately upon becoming aware of any breach of security or unauthorized use of your account.": "Você concorda em não divulgar sua senha a nenhum terceiro. Você deve nos notificar imediatamente ao tomar conhecimento de qualquer violação de segurança ou uso não autorizado de sua conta.",
    "You may use our Services only for lawful purposes and in accordance with these Terms. You agree not to use the Services:": "Você pode usar nossos Serviços apenas para fins legais e de acordo com estes Termos. Você concorda em não usar os Serviços:",
    "In any way that violates any applicable national or international law or regulation.": "De qualquer forma que viole qualquer lei ou regulamentação nacional ou internacional aplicável.",
    "For the purpose of exploiting, harming, or attempting to exploit or harm minors in any way.": "Com o propósito de explorar, prejudicar ou tentar explorar ou prejudicar menores de qualquer forma.",
    "To transmit, or procure the sending of, any advertising or promotional material, including any \"junk mail,\" \"chain letter,\" \"spam,\" or any other similar solicitation.": "Para transmitir, ou providenciar o envio de, qualquer material publicitário ou promocional, incluindo qualquer \"spam\", \"corrente\", \"spam\", ou qualquer outra solicitação similar.",
    "To impersonate or attempt to impersonate Toolz.at, a Toolz.at employee, another user, or any other person or entity.": "Para se passar ou tentar se passar por Toolz.at, um funcionário da Toolz.at, outro usuário ou qualquer outra pessoa ou entidade.",
    "To engage in any other conduct that restricts or inhibits anyone's use or enjoyment of the Services, or which, as determined by us, may harm Toolz.at or users of the Services, or expose them to liability.": "Para realizar qualquer outra conduta que restrinja ou impeça o uso ou o prazer de qualquer pessoa nos Serviços, ou que, conforme determinado por nós, possa prejudicar o Toolz.at ou seus usuários, ou expô-los à responsabilidade.",
    "Additionally, you agree not to:": "Além disso, você concorda em não:",
    "Use the Services in any manner that could disable, overburden, damage, or impair the site or interfere with any other party's use of the Services.": "Usar os Serviços de qualquer maneira que possa desativar, sobrecarregar, danificar ou prejudicar o site ou interferir no uso dos Serviços por qualquer outra parte.",
    "Use any robot, spider, or other automatic device, process, or means to access the Services for any purpose, including monitoring or copying any of the material on the Services.": "Usar qualquer robô, spider, ou outro dispositivo automático, processo ou meio para acessar os Serviços para qualquer fim, incluindo monitorar ou copiar qualquer material dos Serviços.",
    "Use any manual process to monitor or copy any of the material on the Services or for any other unauthorized purpose without our prior written consent.": "Usar qualquer processo manual para monitorar ou copiar qualquer material dos Serviços ou para qualquer outro fim não autorizado sem o nosso consentimento por escrito.",
    "Use any device, software, or routine that interferes with the proper working of the Services.": "Usar qualquer dispositivo, software ou rotina que interfira no funcionamento adequado dos Serviços.",
    "Introduce any viruses, trojan horses, worms, logic bombs, or other material which is malicious or technologically harmful.": "Introduzir qualquer vírus, cavalos de troia, worms, bombas lógicas ou outros materiais prejudiciais ou tecnologicamente danosos.",
    "Attempt to gain unauthorized access to, interfere with, damage, or disrupt any parts of the Services, the server on which the Services is stored, or any server, computer, or database connected to the Services.": "Tentar obter acesso não autorizado, interferir, danificar ou interromper qualquer parte dos Serviços, o servidor onde os Serviços estão armazenados, ou qualquer servidor, computador ou banco de dados conectado aos Serviços.",
    "Attack the Services via a denial-of-service attack or a distributed denial-of-service attack.": "Atacar os Serviços via ataque de negação de serviço ou ataque distribuído de negação de serviço.",
    "Otherwise attempt to interfere with the proper working of the Services.": "De outra forma, tentar interferir no funcionamento adequado dos Serviços.",
    "Our Services include various online tools designed to assist users with specific tasks. You acknowledge that:": "Nossos Serviços incluem várias ferramentas online projetadas para ajudar os usuários em tarefas específicas. Você reconhece que:",
    "These tools are provided for general information and convenience purposes only.": "Essas ferramentas são fornecidas apenas para fins informativos e de conveniência.",
    "Results or outputs from these tools should not be relied upon in making any decisions without verification from other sources.": "Os resultados ou saídas dessas ferramentas não devem ser usados para tomar decisões sem verificação de outras fontes.",
    "We make no representations or warranties about the accuracy, completeness, or reliability of the results or outputs from these tools.": "Não fazemos representações ou garantias sobre a precisão, integridade ou confiabilidade dos resultados ou saídas dessas ferramentas.",
    "You are solely responsible for how you use the information, results, or outputs obtained from our tools.": "Você é o único responsável por como usa as informações, resultados ou saídas obtidas de nossas ferramentas.",
    "5.1 Rate Limiting and Fair Usage": "5.1 Limitação de Taxa e Uso Justo",
    "To ensure fair access to our Services for all users, we may implement rate limiting or other usage restrictions. Excessive use of our tools, as determined by us, may result in temporary or permanent restrictions on your access to the Services.": "Para garantir acesso justo aos nossos Serviços para todos os usuários, podemos implementar limitação de taxa ou outras restrições de uso. O uso excessivo de nossas ferramentas, conforme determinado por nós, pode resultar em restrições temporárias ou permanentes ao seu acesso aos Serviços.",
    "Our Services may contain links to third-party websites or services that are not owned or controlled by Toolz.at.": "Nossos Serviços podem conter links para sites ou serviços de terceiros que não são de propriedade ou controlados pela Toolz.at.",
    "Toolz.at has no control over, and assumes no responsibility for, the content, privacy policies, or practices of any third-party websites or services. You further acknowledge and agree that Toolz.at shall not be responsible or liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any such content, goods, or services available on or through any such websites or services.": "A Toolz.at não tem controle sobre, e não assume nenhuma responsabilidade pelo conteúdo, políticas de privacidade ou práticas de quaisquer sites ou serviços de terceiros. Você reconhece e concorda que a Toolz.at não será responsável, direta ou indiretamente, por qualquer dano ou perda causado ou alegadamente causado pelo uso ou confiança em qualquer conteúdo, bens ou serviços disponíveis nesses sites ou serviços de terceiros.",
    "We strongly advise you to read the terms and conditions and privacy policies of any third-party websites or services that you visit.": "Recomendamos fortemente que você leia os termos e condições e as políticas de privacidade de qualquer site ou serviço de terceiros que você visitar.",
    "THE SERVICES ARE PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS. TOOLZ.AT AND ITS SUPPLIERS AND LICENSORS HEREBY DISCLAIM ALL WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. NEITHER TOOLZ.AT NOR ITS SUPPLIERS AND LICENSORS MAKES ANY WARRANTY THAT THE SERVICES WILL BE ERROR FREE OR THAT ACCESS THERETO WILL BE CONTINUOUS OR UNINTERRUPTED.": "OS SERVIÇOS SÃO FORNECIDOS NO ESTADO EM QUE SE ENCONTRAM E CONFORME DISPONÍVEIS. A TOOLZ.AT E SEUS FORNECEDORES E LICENCIADORES ISENTAM-SE DE TODAS AS GARANTIAS DE QUALQUER TIPO, EXPRESSAS OU IMPLÍCITAS, INCLUINDO, SEM LIMITAÇÃO, GARANTIAS DE COMERCIABILIDADE, ADEQUAÇÃO A UM FIM ESPECÍFICO E NÃO INFRAÇÃO. NEM A TOOLZ.AT NEM SEUS FORNECEDORES E LICENCIADORES FAZEM QUALQUER GARANTIA DE QUE OS SERVIÇOS SERÃO SEM ERROS OU DE QUE O ACESSO A ELES SERÁ CONTÍNUO OU ININTERRUPTO.",
    "IN NO EVENT WILL TOOLZ.AT, OR ITS SUPPLIERS OR LICENSORS, BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, NEGLIGENCE, STRICT LIABILITY, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES; (II) THE COST OF PROCUREMENT OF SUBSTITUTE PRODUCTS OR SERVICES; OR (III) FOR INTERRUPTION OF USE OR LOSS OR CORRUPTION OF DATA.": "EM NENHUM CASO A TOOLZ.AT, OU SEUS FORNECEDORES OU LICENCIADORES, SERÃO RESPONSÁVEIS EM RELAÇÃO A QUALQUER MATÉRIA DESTE ACORDO SOB QUALQUER TEORIA DE CONTRATO, NEGLIGÊNCIA, RESPONSABILIDADE RESTRITA OU OUTRA TEORIA LEGAL OU EQUITÁVEL POR: (I) DANOS ESPECIAIS, INCIDENTAIS OU CONSEQUENCIAIS; (II) O CUSTO DE AQUISIÇÃO DE PRODUTOS OU SERVIÇOS SUBSTITUTOS; OU (III) INTERROMPENDO O USO OU PERDA OU CORRUPÇÃO DE DADOS.",
    "You agree to indemnify and hold harmless Toolz.at, its contractors, and its licensors, and their respective directors, officers, employees, and agents from and against any and all claims and expenses, including attorneys' fees, arising out of your use of the Services, including but not limited to your violation of this Agreement.": "Você concorda em indenizar e isentar a Toolz.at, seus contratados e licenciadores, e seus respectivos diretores, executivos, funcionários e agentes de e contra quaisquer e todas as reclamações e despesas, incluindo honorários advocatícios, decorrentes do seu uso dos Serviços, incluindo, mas não se limitando, à violação deste Acordo.",
    "We may terminate or suspend your access to all or part of our Services immediately, without prior notice or liability, for any reason whatsoever, including without limitation if you breach the Terms.": "Podemos encerrar ou suspender seu acesso a todos ou parte de nossos Serviços imediatamente, sem aviso prévio ou responsabilidade, por qualquer motivo, incluindo, sem limitação, se você violar os Termos.",
    "All provisions of the Terms which by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity, and limitations of liability.": "Todas as disposições dos Termos que, por sua natureza, devem sobreviver à rescisão, sobreviverão à rescisão, incluindo, sem limitação, disposições de propriedade, isenções de garantia, indenização e limitações de responsabilidade.",
    "We reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is material, we will try to provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion.": "Reservamos o direito, a nosso exclusivo critério, de modificar ou substituir estes Termos a qualquer momento. Se uma revisão for material, tentaremos fornecer pelo menos 30 dias de aviso antes que os novos termos entrem em vigor. O que constitui uma alteração material será determinado a nosso exclusivo critério.",
    "By continuing to access or use our Services after those revisions become effective, you agree to be bound by the revised terms. If you do not agree to the new terms, please stop using the Services.": "Ao continuar a acessar ou usar nossos Serviços após essas revisões entrarem em vigor, você concorda em estar vinculado aos termos revisados. Se você não concorda com os novos termos, por favor, pare de usar os Serviços.",
    "These Terms shall be governed and construed in accordance with the laws of the country where Toolz.at operates, without regard to its conflict of law provisions.": "Estes Termos serão regidos e interpretados de acordo com as leis do país onde a Toolz.at opera, sem considerar suas disposições de conflito de leis.",
    "Our failure to enforce any right or provision of these Terms will not be considered a waiver of those rights. If any provision of these Terms is held to be invalid or unenforceable by a court, the remaining provisions of these Terms will remain in effect.": "Nossa falha em fazer cumprir qualquer direito ou disposição destes Termos não será considerada uma renúncia a esses direitos. Se qualquer disposição destes Termos for considerada inválida ou inexequível por um tribunal, as demais disposições destes Termos permanecerão em vigor.",
    "If you have any questions about these Terms, please contact us at:": "Se você tiver dúvidas sobre estes Termos, entre em contato conosco através de:",
    "Email: ": "E-mail: ",
    "About": "Sobre",
    "Or via our ": "Ou através do nosso ",
    "Why Choose Our Tools?": "Por que escolher nossas ferramentas?",
    "Free Forever": "Grátis para sempre",
    "All our tools are completely free to use, with no hidden charges or subscription fees.": "Todas as nossas ferramentas são completamente gratuitas, sem cobranças ocultas ou taxas de assinatura.",
    "Privacy First": "Privacidade em primeiro lugar",
    "Most tools process data directly in your browser, ensuring your information stays private.": "A maioria das ferramentas processa os dados diretamente no seu navegador, garantindo que suas informações permaneçam privadas.",
    "No Registration": "Sem cadastro",
    "Start using our tools immediately - no account creation or sign-up required.": "Use nossas ferramentas imediatamente — sem necessidade de criar conta ou se cadastrar.",
    "Regular Updates": "Atualizações frequentes",
    "We continuously improve our tools based on user feedback and needs.": "Aprimoramos continuamente nossas ferramentas com base no feedback e nas necessidades dos usuários.",
    "Our Mission": "Nossa missão",
    "At Toolz.at, we believe that useful tools should be accessible to everyone. Our mission is to create and provide free, high-quality web tools that make everyday tasks easier and more efficient.": "Na Toolz.at, acreditamos que ferramentas úteis devem ser acessíveis a todos. Nossa missão é criar e oferecer ferramentas web gratuitas e de alta qualidade que tornam as tarefas do dia a dia mais fáceis e eficientes.",
    "Our Values": "Nossos valores",
    "Accessibility": "Acessibilidade",
    "We believe in making tools that are accessible to everyone, regardless of their technical expertise or financial means.": "Acreditamos em criar ferramentas acessíveis para todos, independentemente do conhecimento técnico ou situação financeira.",
    "Simplicity": "Simplicidade",
    "Our tools are designed to be intuitive and easy to use, focusing on solving specific problems without unnecessary complexity.": "Nossas ferramentas são projetadas para serem intuitivas e fáceis de usar, focando na solução de problemas específicos sem complexidade desnecessária.",
    "Privacy": "Privacidade",
    "We respect user privacy and ensure that our tools process data securely, often directly in the browser without server storage.": "Respeitamos a privacidade do usuário e garantimos que nossas ferramentas processem os dados com segurança, frequentemente diretamente no navegador sem armazenamento em servidor.",
    "Quality": "Qualidade",
    "Every tool we create undergoes rigorous testing to ensure reliability and excellent performance.": "Cada ferramenta que criamos passa por testes rigorosos para garantir confiabilidade e excelente desempenho.",
    "Our Story": "Nossa história",
    "Toolz.at started with a simple idea: creating useful web tools that solve real problems. What began as a collection of personal utilities has grown into a platform offering various tools for different needs, from web development to productivity enhancement.": "A Toolz.at começou com uma ideia simples: criar ferramentas web úteis que resolvem problemas reais. O que começou como uma coleção de utilitários pessoais se transformou em uma plataforma com diversas ferramentas para diferentes necessidades, desde desenvolvimento web até aumento de produtividade.",
    "Our journey continues as we develop new tools and improve existing ones, always guided by user feedback and emerging needs in the digital world.": "Nossa jornada continua com o desenvolvimento de novas ferramentas e melhorias nas já existentes, sempre guiados pelo feedback dos usuários e pelas necessidades emergentes do mundo digital.",
    "Our Commitment": "Nosso compromisso",
    "We are committed to:": "Estamos comprometidos com:",
    "Maintaining and improving our existing tools": "Manter e melhorar nossas ferramentas existentes",
    "Developing new tools based on user needs and feedback": "Desenvolver novas ferramentas com base nas necessidades e no feedback dos usuários",
    "Keeping our tools free and accessible": "Manter nossas ferramentas gratuitas e acessíveis",
    "Protecting user privacy and data security": "Proteger a privacidade dos usuários e a segurança dos dados",
    "Building a helpful community around our platform": "Construir uma comunidade colaborativa em torno da nossa plataforma",
    "Join Our Journey": "Junte-se à nossa jornada",
    "Have ideas for new tools or ways to improve existing ones? We'd love to hear from you!": "Tem ideias para novas ferramentas ou maneiras de melhorar as existentes? Adoraríamos ouvir você!",
    "Explore Our Tools": "Explorar nossas ferramentas",
    "About Toolz": "Sobre a Toolz",
    "Making the web more useful, one tool at a time.": "Tornando a web mais útil, uma ferramenta de cada vez.",
    "404": "404",
    "Page Not Found": "Página não encontrada",
    "Oops! The page you're looking for doesn't exist or has been moved.": "Ops! A página que você está procurando não existe ou foi movida.",
    "Go to Homepage": "Ir para a página inicial",
    "A collection of helpful web tools designed to make your digital life easier. Free, fast, and easy to use. Everyday news contents in us blog.": "Uma coleção de ferramentas web úteis projetadas para facilitar sua vida digital. Grátis, rápido e fácil de usar. Conteúdos diários de notícias em nosso blog.",
    "Toolz, free tools, online tools, web tools, digital life, productivity, finacial, tech, technology, blog, articles, news, shortnner, consent mode": "Toolz, ferramentas gratuitas, ferramentas online, ferramentas web, vida digital, produtividade, finanças, tecnologia, blog, artigos, notícias, encurtador, modo de consentimento",
    "Opss! page not found!": "Opss! página não encontrada!",
    "Learn more about Toolz, our mission, values, and commitment to providing useful web tools for everyone.": "Saiba mais sobre a Toolz, nossa missão, valores e compromisso em fornecer ferramentas web úteis para todos.",
    "About, Toolz, Mission, Values, Commitment, Web Tools": "Sobre, Toolz, Missão, Valores, Compromisso, Ferramentas Web",
    "Explore our blog for insights, tutorials, and tips on web development, tools, technology and how AI is growing up. Stay updated with the latest trends and best practices in the industry.": "Explore nosso blog para obter insights, tutoriais e dicas sobre desenvolvimento web, ferramentas, tecnologia e como a IA está crescendo. Fique atualizado com as últimas tendências e melhores práticas do setor.",
    "Blog, Web Development, Technology, AI, Tutorials, Insights, Toolz": "Blog, Desenvolvimento Web, Tecnologia, IA, Tutoriais, Insights, Toolz",
    "Have questions, suggestions, or feedback? Get in touch with us! We'd love to hear from you!": "Tem perguntas, sugestões ou feedback? Entre em contato conosco! Adoraríamos ouvir você!",
    "Contact, Feedback, Support, Toolz, Contact Us, Reach Out, Inquiries, Suggestions, Help, Questions": "Contato, Feedback, Suporte, Toolz, Contate-Nos, Entre em contato, Consultas, Sugestões, Ajuda, Perguntas",
    "Privacy Policy of Toolz.at - Your privacy is important to us. This policy outlines how we collect, use, and protect your personal information.": "Política de Privacidade do Toolz.at - Sua privacidade é importante para nós. Esta política descreve como coletamos, usamos e protegemos suas informações pessoais.",
    "Privacy Policy, Toolz.at, Data Protection, GDPR, Cookies": "Política de Privacidade, Toolz.at, Proteção de Dados, GDPR, Cookies",
    "Terms of Use for Toolz.at website and services. Read our terms and conditions for using our tools and services.": "Termos de Uso do site e serviços Toolz.at. Leia nossos termos e condições para usar nossas ferramentas e serviços.",
    "Terms of Use, Toolz, Terms and Conditions, User Agreement, Legal Information": "Termos de Uso, Toolz, Termos e Condições, Acordo do Usuário, Informações Legais",
    "All our tools are completely free to use, with no hidden charges or subscription fees. Most tools process data directly in your browser, ensuring your information stays private. Start using our tools immediately - no account creation or sign-up required.": "Todas as nossas ferramentas são completamente gratuitas, sem cobranças ocultas ou taxas de assinatura. A maioria das ferramentas processa os dados diretamente no seu navegador, garantindo que suas informações permaneçam privadas. Use nossas ferramentas imediatamente — sem necessidade de criar conta ou se cadastrar.",
    "Tools, Free Tools, Web Development, Productivity, Finance, Miscellaneous, shortener url, consent mode, timer, chronometer, keyboard test": "Ferramentas, Ferramentas Gratuitas, Desenvolvimento Web, Produtividade, Finanças, Diversos, encurtador de url, modo de consentimento, cronômetro, cronômetro, teste de teclado"
}
